---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
OBJImportOptions Constructor
OBJImportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | OBJImportOptions()()()() | Constructs a new instance of OBJImportOptions with default values of all properties. |
|  | OBJImportOptions(OBJImportOptions) | Constructs a new instance of OBJImportOptions as a copy of the import options. |

# See Also

OBJImportOptions Class

OBJImportOptions Members

Autodesk.Revit.DB Namespace